[
  {
    "id": 17,
    "heading": "TikTok Canada/Aus/Nz",
    "slug": "tiktok",
    "subHeading": "EDM Development & CRM integration  | Akcelo",
    "date": "2022-02-01",
    "technology": ["Foundation for Email", "Mailchimp", "HTML5", "CSS"],
    "desc": "",
    "thumb": "/portfolio/front/tiktok.jpg",
    "video": "/portfolio/front/tiktok.mp4",
    "mainVideo": "/portfolio/items/tiktok.mp4",
    "link": "",
    "recommended": 1
  },
  {
    "id": 16,
    "heading": "Petculture",
    "slug": "petculture",
    "subHeading": "EDM Development & CRM integration  | Akcelo",
    "date": "2021-02-01",
    "technology": ["Foundation for Email", "Klaviyo", "HTML5", "CSS"],
    "desc": "",
    "thumb": "/portfolio/front/petculture.jpg",
    "video": "/portfolio/front/petculture.mp4",
    "mainVideo": "/portfolio/items/petculture.mp4",
    "link": "",
    "recommended": 2
  },
  {
    "id": 15,
    "heading": "Wisemans Surf Lodge",
    "slug": "wisemans",
    "subHeading": "EDM Development & CRM integration  | Akcelo",
    "date": "2021-03-01",
    "technology": ["Foundation for Email", "Hubspot", "HTML5", "CSS"],
    "desc": "",
    "thumb": "/portfolio/front/wiseman.jpg",
    "video": "/portfolio/front/wiseman.mp4",
    "mainVideo": "/portfolio/items/wiseman.mp4",
    "link": "",
    "recommended": 2
  },
  {
    "id": 14,
    "heading": "hummgroup",
    "slug": "hummgroup",
    "subHeading": "Inhouse Frontend Developer & Digital Designer",
    "date": "2020-10-01",
    "technology": ["Foundation for Email", "HTML5", "CSS", "Adobe CC", "Figma"],
    "desc": "",
    "thumb": "/portfolio/front/hummgroup.jpg",
    "video": "/portfolio/front/hummgroup.mp4",
    "mainVideo": "/portfolio/items/hummgroup.mp4",
    "link": "",
    "recommended": 3
  },
  {
    "id": 13,
    "heading": "Hyland Communication Agency",
    "slug": "hyland",
    "subHeading": "Inhouse Wordpress Developer & HTML5 Banners SUITE",
    "date": "2020-05-01",
    "technology": ["Wordpress", "HTML5", "CSS", "PHP", "Adobe CC"],
    "desc": "",
    "thumb": "/portfolio/front/hyland.jpg",
    "video": "/portfolio/front/hyland.mp4",
    "mainVideo": "/portfolio/items/hyland.mp4",
    "link": "http:///www.siecap.com.au",
    "recommended": 4
  },
  {
    "id": 12,
    "heading": "University of Sydney",
    "slug": "universityofsydney",
    "subHeading": "HTML5 Banner Suite",
    "date": "2019-01-01",
    "technology": ["Photoshop", "Animate", "HTML5", "Javascript", "Doubleclick"],
    "desc": "",
    "thumb": "/portfolio/front/university.jpg",
    "video": "/portfolio/front/university.mp4",
    "mainVideo": "/portfolio/items/university.mp4",
    "link": "",
    "recommended": 5
  },
  {
    "id": 11,
    "heading": "Richards Rose",
    "slug": "richardsrose",
    "subHeading": "Wordpress build",
    "date": "2018-05-01",
    "technology": ["Wordpress", "HTML5", "CSS", "Javascript", "PHP"],
    "desc": "<p>When Richards Rose announced its independence from AJF Partnership, they needed a new web presence to supplement their relaunch. I was contracted to build their new agency site since I already had a good relationship & proven track record with AJF Partnership/Richards Rose. I was given a little more than a wireframe & a PSD design file, and with it I was able to turn around a fully fledged responsive and customisable Wordpress site within two weeks.</p><p>This site was tailored to be easily editable by the staff at Richards Rose, using user-friendly plugins and custom CSS. The agency’s homepage has gone through some updates, client changes and additions since its inception, but it has all been built on the Wordpress foundation that I provided.</p>",
    "thumb": "/portfolio/front/richardrose.jpg",
    "video": "/portfolio/front/richardrose.mp4",
    "mainVideo": "/portfolio/items/richardrose.mp4",
    "link": "http://www.richardsrose.com.au/",
    "recommended": 4
  },
  {
    "id": 10,
    "heading": "Stan",
    "slug": "stan",
    "subHeading": "HTML5 Banner Suite",
    "date": "2017-05-01",
    "technology": ["Animate"],
    "desc": "<p>I was contracted by Richards Rose to produce HTML5 banners for the Australian streaming company Stan, which was briefed to have the titles, the show logo, the hero image and the accompanied video to be all dynamically alterable. Originally, it was designed with HTML5 and GSAP in mind, but given the complexity of the animations and the masking effects, it was rebuilt using the robust features found in Animate CC.</p> <p>Lightweight, customisable and with the ability to export to HTML5 -  these banners were built in a way so any team member with even the most modest experience in Animate CC could replace any element with minimal fuss, creating a customisable dynamic experience without the headaches.</p>",
    "thumb": "/portfolio/front/stanBanners.jpg",
    "video": "/portfolio/front/stanBanners.mp4",
    "mainVideo": "/portfolio/items/stanBanners.mp4",
    "link": "",
    "recommended": 4
  },
  {
    "id": 9,
    "heading": "Richards Rose",
    "slug": "richardsrose-html5-banners",
    "subHeading": "HTML5 Banner Suite",
    "date": "2017-01-01",
    "technology": ["Animate", "HTML5", "CSS", "Javascript", "GSAP"],
    "desc": "<p>I specialised in creating Flash banners for advertising agencies early in my career. But when Google killed Flash by implementing a “click-to-play” feature within Chrome in 2015, it destroyed the Flash banner industry overnight. Fortunately, my skills in animation and AS2 development could be transferred into HTML5 technologies. AJF Partnership and Richards Rose were generous enough to allow me to transition from creating SWF banners, into using HTML5. Below is the banner suite I have made during my freelance career with Richards Rose.</p><p>Typically, my banners are either built using Animate CC and exported to CanvasJS, or hand coded using traditional front end techniques using HTML5, CSS, JS and GSAP. I still find banner production to be enjoyable, challenging and rewarding, and while I’ll probably never make another SWF banner again, the benefits of correctly using HTML5 outweigh the limitations of SWF.</p>",
    "thumb": "/portfolio/front/RicharRoseHtml5BannerBuilds.jpg",
    "video": "/portfolio/front/RicharRoseHtml5BannerBuilds.mp4",
    "mainVideo": "/portfolio/items/RicharRoseHtml5BannerBuilds.mp4",
    "link": "",
    "recommended": 3
  },
  {
    "id": 8,
    "heading": "Richards Rose",
    "slug": "richardsrose-motion-suite",
    "subHeading": "Motion Build Suite",
    "date": "2017-01-01",
    "technology": ["Photoshop", "After Effects"],
    "desc": "<p>With impressive codecs, the HTML5 video tag, and faster internet connections, motion design has become more relevant for advertising, social media pages and digital displays than the early days of HTML4 and SWF. I have a strong background in animation and After Effects, and so whenever Richards Rose needed a motion designer to convert their Photoshop storyboards into a deliverable video, I always accepted their freelance work if I was available.</p><p>Each motion piece I produced was built around their given specs, converting their flat PSD artboards into deliverable MP4s that are engaging, accessible and conveyed a memorable message. These designs are then exported to be shown on public displays, social media pages or TVCs. Below is some of the motion suite I have made during my freelance career with Richards Rose.</p>",
    "thumb": "/portfolio/front/richardsRoseMotionSuite.jpg",
    "video": "/portfolio/front/richardsRoseMotionSuite.mp4",
    "mainVideo": "/portfolio/items/richardsRoseMotionSuite.mp4",
    "link": "",
    "recommended": 3
  },
  {
    "id": 7,
    "heading": "DJ Ravine",
    "slug": "djravine",
    "subHeading": "Brand Identity",
    "date": "2016-06-01",
    "technology": ["Illustrator", "Photoshop", "After Effects", "Social Media"],
    "desc": "<p>Dj Ravine is a world renown YouTuber, music producer and personal friend. With 500,000 subscribers earned through his videos, he didn’t yet have a brand identity that reflected his online presence.</p><p>Following design treads found in the electronic music industry and other online personalities, I designed an original logo and manipulated a custom font to create his new brand, as well as producing video overlays, social media backgrounds and 3D animations that are used across his social media accounts.</p><p>This brand identity, which was originally drawn in my sketch book, is now found in circulated flyers, stickers, display LEDs, and 3d printed accessories - supplementing his real life identity with a recognisable graphical brand.</p>",
    "thumb": "/portfolio/front/ravine.jpg",
    "video": "/portfolio/front/ravine.mp4",
    "mainVideo": "/portfolio/items/ravine.mp4",
    "link": "",
    "recommended": 4
  },
  {
    "id": 6,
    "heading": "Let It Go with Crystal Maiden",
    "slug": "letitgo",
    "subHeading": "Youtube Video & Steam Workshop Item",
    "date": "2015-06-01",
    "technology": ["3d", "After Effects", "Premiere", "Steam Workshop", "audio"],
    "desc": "<p>“Let It Go” with Crystal Maiden is an original 3d cinematic parody of “Let It Go” from Frozen. The video was produced and animated by myself, sung by Janice Pan, and was produced between three to six months. It features a large number of digital effects including; character rigging, particle effects, animation and an original score that was released as a 5 minute YouTube short.</p><p>A custom cosmetic piece was also crafted for this character which supplemented the original launch of this video. This was created for the Steam Workshop as a potential revenue stream and was marketed with the “Let It Go” short film.</p><p>“Let It Go” has now accumulated over 1.4 million views on YouTube, and has inspired a follow-up The making of “Let It Go” presentation on the same channel.</p>",
    "thumb": "/portfolio/front/letitgo.jpg",
    "video": "/portfolio/front/letitgo.mp4",
    "mainVideo": "/portfolio/items/letitgo.mp4",
    "link": "https://www.youtube.com/watch?v=veGbtkyoe_Q",
    "recommended": 1
  },
  {
    "id": 5,
    "heading": "Pudge Creek",
    "slug": "pudgecreek",
    "subHeading": "YouTube Video",
    "date": "2014-07-01",
    "technology": ["3d", "After Effects", "Premiere", "Social Media"],
    "desc": "<p>Pudge Creek is a digital remake of the Wolf Creek trailer. The idea was to replace John Jarratt's character with a 3d game character for the Dota2 community.</p><p>The work involved creating and rigging a 3d model. Assigning animation controllers and cloth dynamics to the model. Matching the model's animation and lighting to Mick Taylor's. And then compositing these shots into After Effects. There was a total of forty-one 3d effect shots. By the end of it, I had replaced Mick Taylor with Pudge within 1.5 weeks.</p><p>With help of a friend, I had submitted this piece to Twitter, Reddit and other communities who would be interested in seeing this video. Once a few key players and gate-keepers saw the treading video on social sites and shared it, the video exploded into popularity. Within 24 hours, there was 5K views on the trailer. Within a week, 40K views. This video is now sitting over 100K views.</p>",
    "thumb": "/portfolio/front/pudgecreek.jpg",
    "video": "/portfolio/front/pudgecreek.mp4",
    "mainVideo": "/portfolio/items/pudgecreek.mp4",
    "link": "https://www.youtube.com/watch?v=OGpwAhMmhyk",
    "recommended": 2
  },
  {
    "id": 4,
    "heading": "AJF Partnership",
    "slug": "ajfpartnership",
    "subHeading": "Freelance Digital Collection",
    "date": "2013-07-01",
    "technology": ["After Effects", "Animate", "HTML5", "CSS", "Javascript"],
    "desc": "<p>I've been a freelance resource for AJF Partnership between 2013 - 2015. During that time, I've worked on multiple digital campaigns and have filled roles such as flash developer, motion designer, front end developer and eDM developer - as well as being a general digital consultant for them. While the creative directors, account holders and their clients came up with the ideas, I was often hired to produce them when their in-house team was either too busy or too inexperienced for digital work.</p><p>I've done a collection of digital work for AJF Partnership; including banners, videos, email template and front-end development. The clients I've worked for are also plentiful; including News Corp, Helga's Bakehouse, Rams Homeloans, Frangelico, Wild Turkey, Wattyl Paints, Sky Vodka, Donut King, Michel's Patisserie and Mr Men.</p>",
    "thumb": "/portfolio/front/ajfCollection.jpg",
    "video": "/portfolio/front/ajfCollection.mp4",
    "mainVideo": "/portfolio/items/ajfCollection.mp4",
    "link": "",
    "recommended": 2
  },
  {
    "id": 3,
    "heading": "Optus",
    "slug": "optus",
    "subHeading": "Go Places Interactive",
    "date": "2012-07-01",
    "technology": ["3d", "After Effects", "Animate"],
    "desc": "<p>Optus Go Places was an interactive video experience showcased in Optus dealerships stores. Users were encourage to interact with a touchscreen which showcased various 3d motion pieces informing people of the Optus Go Places services.</p><p>These videos were built in After Effect with some elements of 3d brought in from 3dsmax whenever depth was required. There were dozens of motion effects in this 720p hi-def motion design including camera work, masking effects, 3d effects and multiple layers tweens to create an engaging piece of video work.</p>",
    "thumb": "/portfolio/front/optusMotion.jpg",
    "video": "/portfolio/front/optusMotion.mp4",
    "mainVideo": "/portfolio/items/optusMotion.mp4",
    "link": "",
    "recommended": 5
  },
  {
    "id": 2,
    "heading": "Powerhouse Productions",
    "slug": "powerhouseproductions",
    "subHeading": "Digital Promotional Campaigns",
    "date": "2011-07-01",
    "technology": ["Strategy", "Art Direction", "UX/UI", "Animate", "Photoshop"],
    "desc": "<p>Powerhouse Productions was Australia’s largest all-aged dance event producer, and I was responsible for all of their digital marketing campaigns. My client's events are marketed to a youthful and energetic demographic, so I had the opportunity to push my Flash abilities to its creative limits. Most of the flash banners created for these events were built to be eye-catching and unique - using particle effects, layer blending, and AS2 driven effects.</p><p>In additional to these banners, occasionally a Flash minisite would be built for the next dance event. They were all uniquely designed, mixed with music, informative and encouraged users to buy tickets online. Built using AS2, no minisite was ever created the same - advancing the awareness of the parties that went way beyond the typical flyer.<p> <p>Ticket sales usually picked up after these sites were built - leading to their first sell out event at the Acer Arena. It also got my name out there as someone who specialised in doing good work for DJs, promoters and events - earning new clients across Australia and the UK.</p>",
    "thumb": "/portfolio/front/php.jpg",
    "video": "/portfolio/front/php.mp4",
    "mainVideo": "/portfolio/items/php.mp4",
    "link": "",
    "recommended": 4
  },
  {
    "id": 1,
    "heading": "VML",
    "slug": "vml",
    "subHeading": "Freelance Digital Collection",
    "date": "2010-07-01",
    "technology": ["Art Direction", "Photoshop", "Animate", "HTML", " CSS"],
    "desc": "<p>Y&R was the first big break in my digital career. GPYR's Head of Digital noticed my Flash portfolio in the golden days of SWF, right where the demand for Flash designers and developers was at its highest. He took a gamble on my digital talents, and I was fortunate enough to be offered a freelance role at GPYR. I worked there for around a year, designing eDMs, coding Flash banner minigames, creating minisites, and even solo created an Australia Idol banner campaign from scratch for a national wide audience. A great experience.</p>",
    "thumb": "/portfolio/front/vml.jpg",
    "video": "/portfolio/front/vml.mp4",
    "mainVideo": "/portfolio/items/vml.mp4",
    "link": "",
    "recommended": 4
  }
]
